<?php

$mainValues = [
    'banned' => 'ربات درحال حاضر قادر به ارائه خدمات نمی‌باشد',
    'customer_custome_plan_day' => "⏰|لطفا  تعداد روز اشتراکت رو وارد کن\n💰|هزینه هر روز: DAY-PRICE",
    'customer_custome_plan_volume'=>"🔋|لطفا مقدار گیگابایت سرویست رو وارد کن\n💰|هزینه هر گیگ: VOLUME-PRICE",
    'customer_custome_plan_name'=>'اسم کانفیگ رو وارد کن ( حروف انگیلیسی و عدد باهم وارد کنید )',
    'send_user_id'=>"🀄️| آیدی عددی کاربر رو بفرس :",
    'enter_decrease_amount'=>"💸 | مبلغی که میخوای ازش کم کنی رو وارد کن:",
    'enter_increase_amount'=>"💸 | مبلغی که میخوای بهش بدی رو وارد کن:",
    'user_not_found'=>"🥴 | همچین کسی رو نداریما اشتباه وارد کردی به نظرم",
    'amount_decreased_from_your_wallet'=> "✅ مبلغ AMOUNT تومان از حساب شما کم شد",
    'amount_decreased_from_user_wallet'=>"✅ مبلغ AMOUNT تومان از کیف پول کاربر مورد نظر کم شد",
    'increase_wallet_cart_to_cart'=>"♻️ عزیزم یه تصویر از فیش واریزی برام ارسال کن :

🔰 <code>ACCOUNT-NUMBER</code> - HOLDER-NAME

✅ بعد از اینکه پرداختت تایید شد مبلغ مورد نظر به کیف پولت اضافه میشه!",
    'order_increase_sent'=>"🥇 سفارش شما با موفقیت ثبت شد.
    بعد از تایید به کیف پولت اضافه میکنم ... 💞",
    'please_send_only_image'=>"لطفا فقط عکس ارسال کنید",
    'reached_main_menu'=>"خب برگشتم عقب اگه کاری داری بگو 😉 | اگه خواستی یکی از گزینه هارو انتخاب کن که کارتو انجام بدم

🚪 /start",
    'increase_wallet_request_message'=>"💳 درخواست ( افزایش موجودی )

💰مبلغ: PRICE تومان
🧑‍💻 نام و نام خانوادگی : NAME
🎯 یوزرنیم : @USERNAME
🎫 کد کاربری : <code>USER-ID</code>
",
    'out_of_connection_capacity'=>'ظرفیت این کانکشن پر شده است',
    'out_of_server_capacity'=>'ظرفیت این سرور پر شده است',
    'can_create_specific_account'=> "روی این پلن فقط AMOUNT اکانت میشه ساخت",
    'buy_account_cart_to_cart'=>"♻️ عزیزم یه تصویر از فیش واریزی یا شماره پیگیری -  ساعت پرداخت - نام پرداخت کننده رو در یک پیام برام ارسال کن :

🔰 <code>ACCOUNT-NUMBER</code> - HOLDER-NAME

✅ بعد از اینکه پرداختت تایید شد ( لینک سرور ) به صورت خودکار از طریق همین ربات برات ارسال میشه!",
    'renew_ccount_cart_to_cart'=>"♻️ عزیزم یه تصویر از فیش واریزی یا شماره پیگیری -  ساعت پرداخت - نام پرداخت کننده رو در یک پیام برام ارسال کن :

🔰 <code>ACCOUNT-NUMBER</code> - HOLDER-NAME",
    'order_buy_sent'=>"🛍 با تشکر از اعتماد شما! سفارش شما با موفقیت ثبت شد و پس از تایید مدیریت ارسال خواهد شد. از صبوریتان سپاسگذاریم",
    'buy_custom_account_request'=>"💓 خرید پلن دلخواه ( TYPE )
    
▫️آیدی کاربر: USER-ID
👨‍💼اسم کاربر: <a href='tg://user?id=USER-ID'>NAME</a>
⚡️ نام کاربری: @USERNAME
💰مبلغ پرداختی: PRICE تومان
✏️ نام سرویس: REMARK
🔋حجم سرویس: VOLUME گیگ
⏰ مدت سرویس: DAYS روز",
'buy_new_account_request'=>"❗️|💳 خرید جدید ( TYPE )

▫️آیدی کاربر: USER-ID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
💰مبلغ پرداختی: PRICE تومان
🚦سرور: SERVERNAME
✏️ نام سرویس: REMARK
🔋حجم سرویس: VOLUME گیگ
⏰ مدت سرویس: DAYS روز",
'buy_new_much_account_request'=>"❗️|💳 خرید جدید ( TYPE )

▫️آیدی کاربر: USER-ID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
💰مبلغ پرداختی: PRICE تومان
🏖 تعداد اکانت: ACCOUNT-COUNT
✏️ نام سرویس: REMARK",
'invite_buy_new_account'=>"👨‍👦‍👦 خرید ( زیر مجموعه )

🧝‍♂️آیدی کاربر: USER-ID
🛡اسم کاربر: NAME
🔖 نام کاربری: USERNAME
💰مبلغ پرداختی: PRICE تومان
🔮 نام سرویس: REMARK
💮 سفارش: FILENAME",
    'renew_order_sent'=>"✅| سفارش تمدید شما با موفقیت ثبت شد و پس از تایید مدیریت کانفیگ شما تمدید خواهد شد. از اینکه ما را انتخاب کردید سپاسگذاریم
    
🚪 /start",
'renew_account_request_message'=>"♻️ تمدید سرویس ( TYPE )

▫️آیدی کاربر: USER-ID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
💰مبلغ پرداختی: PRICE تومان
✏️ نام سرویس: REMARK
🔋حجم سرویس: VOLUME گیگ
⏰ مدت سرویس: DAYS روز",
'increase_account_request_message'=>"⏰ درخواست افزایش ( TYPE سرویس )

▫️آیدی کاربر: USER-ID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
🎈 نام سرویس: REMARK
🔋TYPE افزایش: INCREASE گیگ/روز
💰قیمت: PRICE تومان",
    'waiting_message'=>'⏳ در حال انتظار ...',
    'join_channel_message'=>"❌ برای استفاده از ربات حتما باید در کانال زیر عضو شوید:
    
✅ بعد از اینکه عضو شدید روی دکمه عضو شدم بزنید

",
    'bot_is_updating'=> "🌛ربات در حال بروزرسانی می باشد ...",
    'select_one_to_show_detail'=> ' 🔅 یکی از سرویس هاتو انتخاب کن و مشخصات کاملش رو ببین :',
    'you_dont_have_config'=>'سرویسی یافت نشد ⚠️ ابتدا باید یک سرویس خریداری کنید.',
    'no_order_found'=> "موردی یافت نشد",
    'config_details_message'=>"وضعیت کانفیگ: STATE
    
🔮 نام کانفیگ : NAME

لینک اتصال: CONNECT-LINK

لینک سابسکریبشن: SUB-LINK
⁮⁮ ⁮⁮ ⁮⁮ ⁮⁮
",
    'please_wait_message'=>"🙃 | لطفا منتظر باشید",
    'send_only_number'=> "لطفا فقط عدد وارد کنید",
    'change_bot_settings_message'=>'🔰هرکدوم از امکانات رو اگه تو ربات استفاده ای نداره ( خاموش ) کن !',
    'saved_successfuly'=>"✅|با موفقیت ذخیره شد",
    'invited_user_joined_message'=>"😍|تبریک یه نفر با لینک شما وارد ربات شد",
    'please_select_from_below_buttons'=>"🔘|لطفا فقط از کلید زیر استفاده کنید",
    'use_iranian_number_only'=>"🔘|لطفا فقط با شماره ایرانی اقدام کنید",
    'phone_confirmed'=>"✅|شماره شما با موفقیت تأیید شد",
    'send_your_phone_number'=>"کاربر گرامی برای استفاده از مجموعه بدلایل امنیتی ابتدا باید شماره تلفن خود را ارسال کنید 👇",
    'start_message'=>'سلام به ربات خرید خودکار Cconfig V2ray خوش اومدید 🌸
    
برای ادامه یکی از گزینه های زیر را انتخاب کنید ❤️

⚡ سرور های مستقیم و تانل شده با کیفیت
🔐 دور زدن نت ملی و مصرف اینترنت کمتر
📡 کمترین اختلال و قطعی در سرور ها
💲 قیمت های مقرون به صرفه و اقتصادی
🌐 مولتی لوکیشن با ۲۲ کشور در هر لینک
☎️ پشتیبانی ۲۴ ساعته تا روز آخر 

🚪 /start',
    'new_member_joined'=>"📢 | یه گل جدید عضو ربات شد :

نام و نام خانوادگی: FULLNAME
نام کاربری: @USERNAME
آیدی عددی: USERID

به نظرم یه پیام براش بفرست مثلا ( تبلیغی یا خوش آمد گویی ) 😍",
    "not_joine_yet"=>"هنوز که عضو کانال نشدی",
    'insert_discount_code'=>"🎁|کد تخفیف تو را وارد کن:",
    "not_valid_discount_code"=>"😔|کد تخفیفی که وارد کردی معتبر نیس",
    'valid_discount_code'=>"✅|کد تخفیف با موفقیت استفاده شد
مقدار تخفیف AMOUNT تومان",
'used_discount_code'=>"☑️|🎁 کد تخفیف استفاده شد

🔰آیدی کاربر: USERID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
🎁 کد تخفیف: DISCOUNTCODE
💰مقدار تخفیف: AMOUNT تومان
⁮⁮ ⁮⁮",
"send_config_uuid"=>"❗️| لینک کانفیگ یا uuid رو برام بفرس اطلاعات کامل رو تحویلت بدم",
'not_correct_text'=>"متن وارد شده معتبر نمی باشد",
'receving_information'=>"♻️در حال دریافت جزییات ... ",
'request_agency_message'=>"درخواست نمایندگی

🔰آیدی کاربر: USERID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
⁮⁮ ⁮⁮",
    'agency_request_sent'=>"درخواست شما با موفقیت ارسال شد، لطفا منتظر باشید!⁮⁮ ⁮⁮",
    'agency_request_already_sent'=>"درخواست شما قبلاً ارسال شده، لطفا منتظر باشید!⁮⁮ ⁮⁮",
    'agency_request_declined'=>"🥺 درخواست شما برای نمایندگی رد گردید",
    'agency_request_approved'=>"✅ درخواست شما برای نمایندگی تأیید شد",
    'send_agent_discount_percent' =>"لطفا مقدار تخفیف این نمایندگی را  به صورت درصد وارد کنید، مثلا 10",
    'agent_setting_message' =>" 🧚🏻‍♀️ نماینده محترم:

از این بخش میتوانید خرید تکی و خرید انبوه داشته باشید و همچنین کانفیگ های خریداری شده را مدیریت کنید",
    'selling_is_off'=>"درحال حاضر فروش بسته می‌باشد. لطفا بعدا مراجعه کنید…",
    'no_server_available'=>"⚠️درحال حاضر موجودی تمامی سرور ها به اتمام رسیده است. لطفا بعدا چک کنید…",
    'buy_sub_select_location' => '  1️⃣ مرحله یک:

نوع سرور مد نظر را انتخاب کنید

🌐مولتی لوکیشن:
 
انتخاب بیشتر کاربران مجموعه این مورد می‌باشد. درحال حاضر ۲۲ لوکیشن در هر لینک بصورت سابسکریپشن ارائه می‌شود و با گذشت زمان لوکیشن ها بیشتر خواهد شد. قیمت مولتی لوکیشن نسبت به تک لوکیشن بیشتر است ولی همچنان پایین ترین قیمت گذاری صورت گرفته. کشور های موجود و مشخصات بیشتر در مرحله پرداخت درج شده است.

🇸🇪سوئد عادی:

این سرور ها نسبت به تانل قیمت کمتری دارند. معمولا کیفیت پایین تری نسبت به تانل دارد ولی قطعی ندارد و برای استفاده روزمره مناسب می‌باشد. موجودی این سرور ها بسیار بالا بوده و در شرایط جنگی هم متصل بوده است

🇸🇪⚡سوئد تانل:

درحال حاضر بهترین کیفیت و پایداری برای این نوع سرور ها میباشد. برای گیمر ها و تریدر های عزیز این نوع توصیه می‌شود چرا که بدلیل استفاده از بهترین سرور ها در زیرساخت داخلی در مقابل هرگونه اختلالات مقاوم بوده و پایداری بیشتری نسبت به بقیه خواهند داشت. موجودی این سرور ها محدود بوده و به شدت برای شرایط جنگی توصیه می‌شود',
    'the_bot_in_not_admin' => "😡|ای بابا ،ربات هنوز تو کانال عضو نشده، اول ربات رو تو کانال ادمین کن و آیدیش رو بفرست",
    'category_not_avilable'=>"هیچ دسته بندی برای این سرور وجود ندارد",
    'receive_categories'=>"♻️ | دریافت دسته بندی ...",
    'buy_sub_select_category'=> "2️⃣ مرحله دوم:

یکی از دسته بندی های زیر را انتخاب کنید

🔋حجمی: دارای مدت زمان و حجم مصرفی محدود هستند ولی محدودیت کاربری ندارند و هر تعداد کاربر میتواند همزمان متصل باشد.

♾️نامحدود: دارای مدت زمان محدود هستند و تعداد کاربران همزمان وصل شده محدودیت دارند. ولی حجم نامحدود بوده و محاسبه نمیشود.

*توجه داشته باشید که سرور های مولتی لوکیشن دسته بندی نامحدود ندارند*",
    'no_plan_available'=>"💡پلنی در این دسته بندی وجود ندارد",
    'receive_plans'=>"📍در حال دریافت لیست پلن ها",
    'buy_sub_select_plan'=> "3️⃣ مرحله سه:

یکی از تعرفه های زیر را نسبت به مصرف خود انتخاب کنید:", 
    'buy_custom_plan'=>'➕ پلن دلخواه تو بخر',
    'select_one_plan_to_edit'=>"یکی از پلن ها رو انتخاب کن تا برات ویرایشش کنم", 
    'enter_account_amount' => "♻️ تعداد اکانت درخواستی رو وارد کن حداکثر هربار 6 عدد:

⚠️ | نکته: در صورت وارد کردن به مقدار بالا احتمالا اکانت ساخته نشود و پنل x-ui گیر کند",
    'send_positive_number'=>"لطفا عددی بزرگتر از 0 وارد کنید",
    'buy_subscription_detail'=>"〽️ نام پلن: PLAN-NAME
        ➖➖➖➖➖➖➖
        💎 قیمت پلن : PRICE
        ➖➖➖➖➖➖➖
        📃 توضیحات :
        DESCRIPTION
        ➖➖➖➖➖➖➖",
    'buy_much_subscription_detail'=>"〽️ نام پلن: PLAN-NAME
        تعداد اکانت: ACCOUNT-COUNT
        قیمت پلن: PRICE
        ➖➖➖➖➖➖➖
        💎 قیمت کل : TOTAL-PRICE
        ➖➖➖➖➖➖➖
        📃 توضیحات :
        DESCRIPTION
        ➖➖➖➖➖➖➖",
    'buy_custom_subscription_detail'=>"〽️ نام پلن: PLAN-NAME
        حجم اختصاصی: VOLUME GB
        مدت اختصاصی: DAYS روز
        ➖➖➖➖➖➖➖
        💎 قیمت پلن : PRICE
        ➖➖➖➖➖➖➖
        📃 توضیحات :
        DESCRIPTION
        ➖➖➖➖➖➖➖",
    "agents_list" => "🔍 لیست نمایندگان:

جهت مشاده آمار فروش نمایندگان روی اسم نماینده کلیک کنید، همچنین میتوانید برای نماینده درصد تعیین کنید یا آن را از لیست نمایندگان خارج کنید",
    'agent_deleted_successfuly'=>"نمایندگی با موفقیت حذف شد",
    'agent_details'=>'🙎‍♂️اطلاعات نماینده AGENT-NAME

سمت راست درآمد و سمت چپ تعداد خرید نماینده می باشد',
    'send_config_remark'=>"لطفا اسم مدنظر برای اکانت وارد کنید (فقط حروف کوچک انگلیسی و عدد مجاز است)",
    'forward_your_message'=>"لطفا پیام مورد نظر خود را به ربات فروارد کنید",
    "enter_ticket_title"=>"💠لطفا موضوع تیکت را ارسال کنید!",
    "enter_ticket_description"=> "💠لطفا متن و یا عکس تیکت را بصورت ساده و مختصر ارسال کنید!",
    "sent_config_to_user"=> '✅ کانفیگ و براش ارسال کردم
ریمارک: REMARK
حجم سرویس: VOLUME گیگ
مدت زمان سرویس: DAYS روز',
    "renewed_config_to_user"=> '✅ کانفیگ و براش تمدید کردم
ریمارک: REMARK
حجم سرویس: VOLUME گیگ
مدت زمان سرویس: DAYS روز',
    'sending_config_to_user'=>'🚀 | سیستم درحال ساخت سرور شما می‌باشد...',
    'config_not_found'=>"کانفیگی با مشخصات گفته شده یافت نشد",
    'incorrect_config_name'=>"لطفا فقط از حروف کوچک انگلیسی همراه چند عدد استفاده کنید",
    'pay_with_tron_wallet'=>"♻️ عزیزم مبلغ AMOUNT ترون رو به والت زیر ارسال کن و تکسید آیدی واریزی ترون رو برام ارسال کن :

🔰 <code>TRON-WALLET</code>",
    'incorrect_tax_id'=>"تکسید آیدی وارد شده نامعتبر است",
    'used_tax_id'=>"این تکسید آیدی قبلا استفاده شده است",
    'in_review_tax_id'=>"تراکنش شما در صف بررسی قرار گرفت",
    'user_taxid_rejected'=>"تراکنش ناموفق TYPE (ترون)
    
آیدی کاربر: USERID
اسم: NAME
یوزرنیم: USERNAME

تکسید آیدی: TAXID

<b>بعد از 5 تلاش رد گردید</b>",
    'your_taxid_rejected'=>"تراکنش TYPE شما با تکسید آیدی: TAXID

<b>بعد از 5 تلاش رد شد</b>",
    'incorrect_user_taxid_rejected'=>"تراکنش ناموفق TYPE (ترون)
    
آیدی کاربر: USERID
اسم: NAME
یوزرنیم: USERNAME

تکسید آیدی: TAXID

<b>به دلیل ثبت تراکنش نادرست رد شد</b>",
    'your_incorrect_taxid_rejected'=>"تراکنش TYPE شما با تکسید آیدی: TAXID

<b>به دلیل ثبت تراکنش نادرست رد شد</b>",
    'partially_paid_user_taxid'=>"تراکنش ناموفق TYPE (ترون)
    
آیدی کاربر: USERID
اسم: NAME
یوزرنیم: USERNAME

تکسید آیدی: TAXID

<b>به دلیل عدم مطابقت مبلغ تراکنش رد شد</b>",
    'you_have_partially_paid'=>"تراکنش TYPE شما با تکسید آیدی: TAXID

<b>به دلیل عدم مطابقت مبلغ تراکنش رد شد</b>",
    'agent_discount_settings'=>"مدیریت تخفیف های نماینده AGENT-NAME",
    'config_doesnt_exist'=>"کانفیگ یافت نشد"
];

$buttonValues = [
    'bot_reports'=>"📉 آمار کلی ربات",
    'message_to_user'=>"📞 پیام خصوصی",
    'user_reports'=>"🔑 اطلاعات کاربر",
    'admins_list'=>"👤 لیست ادمین ها",
    'increase_wallet'=>"💵 افزایش موجودی",
    'decrease_wallet'=>"💸 کاهش موجودی",
    'create_account'=>"⌨️ ایجاد اکانت انبوه",
    'ban_user'=>"❌ مسدود کردن کاربر",
    'unban_user'=>"✅ آزاد کردن کاربر",
    'server_settings'=>'🚦مدیریت و تنظیمات سرورها',
    'categories_settings'=>'🗂 مدیریت دسته ها',
    'plan_settings'=>'🪣 مدیریت پلن ها',
    'discount_settings'=>"🎁 مدیریت تخفیف ها",
    'main_button_settings'=>"🕹 مدیریت دکمه ها ",
    'gateways_settings'=>'💳 تنظیمات درگاه و کانال',
    'bot_settings'=>'⚙️ تنظیمات ربات',
    'tickets_list'=>'📪 تیکت ها',
    'message_to_all'=>"📨 ارسال پیام همگانی",
    'forward_to_all'=>"📨 فروارد پیام همگانی",
    'back_to_main'=>'⤵️ بازگشت ',  
    'cart_to_cart'=>"💳 کارت به کارت",
    'now_payment_gateway'=>"💳 درگاه NowPayment",
    'zarinpal_gateway'=> "💳 درگاه زرین پال",
    'nextpay_gateway'=>"💳 درگاه نکست پی",
    'weswap_gateway'=>"💳 درگاه ارزی ریالی",
    'approve' => 'تایید ✅',
    'approved' => 'تایید شد',
    'decline' => 'عدم تایید ❌',
    'declined' => 'رد شد',
    'back_button'=> "برگشت 🔙",
    'renew_connection_link'=>"🚷 قطع دسترسی و لینک جدید",
    'update_config_connection'=>"⌛️ بروزرسانی کانفیگ",
    'increase_config_volume'=>"🩸 افزایش حجم سرویس",
    'increase_config_days'=>"📆 افزایش زمان سرویس",
    'renew_config'=>'♻ تمدید سرویس',
    'change_config_location'=>'🌎 تغییر لوکیشن',
    'selected_protocol'=>"🚦 پروتکل انتخابی",
    'volume_left'=>"⏳ حجم باقیمانده:",
    'expire_date'=>"⏰  تاریخ انقضاء: ",
    'buy_date'=>"⏰  تاریخ خرید: ",
    'plan_name'=>" 🚀 نام پلن:",
    'on'=>"روشن ✅",
    'off'=>"خاموش ❌",
    'active'=>"فعال 🟢",
    'deactive'=>"غیر فعال 🔴",
    'send_phone_number'=>'☎️ ارسال شماره',
    'send_message_to_user'=>"✉️ ارسال پیام به کاربر ",
    'cancel' => '↩️بازگشت',
    'join_channel'=>"عضویت در کانال",
    'have_joined'=>"عضو شدم ✅",
    'gift_volume_day'=>"🎯 هدیه حجم و زمان",
    'test_account'=>"🎁 دریافت سرویس تست ",
    'invite_friends'=>"💰 زیر مجموعه گیری",
    'my_info'=>"👤 حساب کاربری",
    'my_subscriptions'=>'🗃 سرویس های من | تمدید',
    'buy_subscriptions'=>'🛒  خرید سرویس',
    'shared_existence'=>"❕ موجودی اشتراکی ",
    'individual_existence'=>"❗️ موجودی اختصاصی ",
    'application_links'=>'🧩 آموزش ها',
    'my_tickets'=>"📨 تیکت های من",
    'search_config'=>"📊دریافت مشخصات اشتراک",
    'delete_config'=>"❌ حذف کانفیگ",
    'pay_with_wallet' => "💰پرداخت با موجودی",
    'request_agency' =>"درخواست نمایندگی 💼",
    'agency_setting' =>"➰ پنل همکاری ➰",
    'agent_one_buy'=>"➕ خرید تکی",
    'agent_much_buy'=>"♾ خرید انبوه",
    'agent_bought_accounts'=>"تعداد خرید",
    'agent_joined_date'=>"تاریخ عضویت",
    'agent_agency_date'=>"تاریخ نمایندگی",
    "agent_list"=>" 📍 مدیریت نمایندگان 📍",
    'search_agent_config'=>"جستجوی کانفیگ",
    'search_admin_config'=>"جستجوی کانفیگ کاربر",
    'sharj'=>"✅ 💳 ارسال رسید - شارژ کیف پول",
    "qr_config"=>"🔳 کیو آر کانفیگ",
    "qr_sub"=>"🔳 کیو آر ساب",
    'start_bot'=>"شروع ربات",
    'enable_config'=>"فعال سازی کانفیگ",
    'disable_config'=>"غیر فعال سازی کانفیگ",
    "tron_gateway"=>"درگاه ترون",
    'plan_discount'=>"روی پلن",
    'server_discount'=>"روی سرور"
];
?>
